1528769/EFM32_Base/src/main.c
/***************************************************************************//**
 * @file
 * @brief FreeRTOS Blink Demo for Energy Micro EFM32GG_STK3700 Starter Kit
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include <stdio.h>
#include <stdlib.h>

#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "croutine.h"

#include "em_chip.h"
#include "bsp.h"
#include "bsp_trace.h"

#include "sleep.h"

#define STACK_SIZE_FOR_TASK    (configMINIMAL_STACK_SIZE + 10)
#define TASK_PRIORITY          (tskIDLE_PRIORITY + 1)

void BSP_I2C_Init(uint8_t addr);
bool I2C_ReadRegister(uint8_t reg, uint8_t *val);
bool I2C_Test();

/* Structure with parameters for LedBlink */
typedef struct {
  /* Delay between blink of led */
  portTickType delay;
  /* Number of led */
  int          ledNo;
} TaskParams_t;

/***************************************************************************//**
 * @brief Simple task which is blinking led
 * @param *pParameters pointer to parameters passed to the function
 ******************************************************************************/


static void LedBlink(void *pParameters)
{
  TaskParams_t     * pData = (TaskParams_t*) pParameters;
  const portTickType delay = pData->delay;

  for (;; ) {
    BSP_LedToggle(pData->ledNo);
    vTaskDelay(delay);
  }
}

static void vATaskRead( void *pParameters ) //generar dades del sensor
{
        // user initialization
	pParameters = 0x3FE7;
	TaskParams_t     * pData = (TaskParams_t*) pParameters;

}

static void vATaskProcess( void *pvParameters ) //crear cua, procesar dades
{
    // user initialization
    while(1)
    {
        -- Task application code here. --
    }
}

static void vATaskPrint( void *pvParameters ) //printar dades
    {
        // user initialization
        while(1)
        {
            -- Task application code here. --
        }
    }
xQueue = xQueueCreate( 1, sizeof( uint16_t));
if(xQueue != NULL)
{
	xTaskCreate( vaTaskRead, ( signed char * ) "Rx", configMINIMAL_STACK_SIZE, NULL, 1, NULL );
	xTaskCreate( prvQueueSendTask, ( signed char * ) "TX", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_SEND_TASK_PRIORITY, NULL );
	vTaskStartScheduler();
}




/***************************************************************************//**
 * @brief  Main function
 ******************************************************************************/
int main(void)
{

  /* Chip errata */
  CHIP_Init();
  BSP_I2C_Init(0x77);
  uint8_t data = 0;

  //I2C_WriteRegister(0xD0, data);
  I2C_ReadRegister(0xD0, &data);
  if(data == 0x60) {
	  printf("Be");
  }
  I2C_Test();
  /* If first word of user data page is non-zero, enable Energy Profiler trace */
  /*BSP_TraceProfilerSetup();

   Initialize LED driver
  BSP_LedsInit();
   Setting state of leds
  BSP_LedSet(0);
  BSP_LedSet(1);

   Initialize SLEEP driver, no calbacks are used
  SLEEP_Init(NULL, NULL);
#if (configSLEEP_MODE < 3)
   do not let to sleep deeper than define
  SLEEP_SleepBlockBegin((SLEEP_EnergyMode_t)(configSLEEP_MODE + 1));
#endif

   Parameters value for taks
  static TaskParams_t parametersToTask1 = { pdMS_TO_TICKS(1000), 0 };
  static TaskParams_t parametersToTask2 = { pdMS_TO_TICKS(500), 1 };

  Create two task for blinking leds
  xTaskCreate(LedBlink, (const char *) "LedBlink1", STACK_SIZE_FOR_TASK, &parametersToTask1, TASK_PRIORITY, NULL);
  xTaskCreate(LedBlink, (const char *) "LedBlink2", STACK_SIZE_FOR_TASK, &parametersToTask2, TASK_PRIORITY, NULL);

  Start FreeRTOS Scheduler
  vTaskStartScheduler();*/

  return 0;

}
